## iam plan
```
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_iam_policy_document.r53_read_policy_document: Reading...
aws_iam_policy.octodns_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/OctoDNSPolicy]
aws_iam_policy.github_dormant_user_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/DormantUserS3Access]
aws_iam_user.octodns_user: Refreshing state... [id=octodns-cicd-user]
aws_iam_policy.secrets_manager_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/operations_engineering_test_secrets_manager_policy]
data.aws_iam_policy_document.r53_read_policy_document: Read complete after 0s [id=2046999383]
aws_iam_policy.r53_read_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/r53_read_policy]
aws_iam_access_key.octodns_access_key: Refreshing state... [id=AKIA42CZXXJSLENF66FF]
data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::880656497252:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Reading...
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Read complete after 0s [id=1907641846]
aws_iam_user_policy_attachment.octodns_user_policy_attachment: Refreshing state... [id=octodns-cicd-user-20240625094312639400000001]
aws_iam_role.assume_cloud_platform_route53_read_role: Refreshing state... [id=assume_cloud_platform_route53_read_role]
aws_iam_role.secrets_manager_role: Refreshing state... [id=operations_engineering_test_secrets_manager_role]
aws_iam_role.github_dormant_user_role: Refreshing state... [id=github_dormant_user_role]
aws_iam_role.r53_backup_role: Refreshing state... [id=operations-engineering-r53-backup-role]
github_actions_secret.octodns_aws_access_key_id: Refreshing state... [id=dns:OCTODNS_AWS_ACCESS_KEY_ID]
github_actions_secret.octodns_aws_secret_access_key: Refreshing state... [id=dns:OCTODNS_AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_role_arn: Refreshing state... [id=operations-engineering:GH_DORMANT_USER_AWS_ROLE_ARN]
aws_iam_role_policy_attachment.role_policy_attachment: Refreshing state... [id=github_dormant_user_role-20240422144734306600000001]
aws_iam_role_policy_attachment.secrets_manager_attachment: Refreshing state... [id=operations_engineering_test_secrets_manager_role-20240711143120224500000001]
github_actions_secret.secrets_manager_role_arn: Refreshing state... [id=operations-engineering:AWS_SECRETS_MANAGER_ROLE_ARN]
aws_iam_role_policy_attachment.r53_read_policy_attachment: Refreshing state... [id=operations-engineering-r53-backup-role-20240227095015143600000001]
github_actions_secret.role_arn: Refreshing state... [id=operations-engineering:AWS_DSD_R53_EXPORT_ROLE_ARN]
github_actions_secret.assume_cloud_platform_route53_read_role_arn: Refreshing state... [id=operations-engineering:ASSUME_CLOUD_PLATFORM_ROUTE53_READ_ROLE_ARN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.assume_cloud_platform_route53_read_role_policy will be created
  + resource "aws_iam_policy" "assume_cloud_platform_route53_read_role_policy" {
      + arn         = (known after apply)
      + description = "A policy that allows a user to assume the Cloud Platforms Route53 Read role"
      + id          = (known after apply)
      + name        = "AssumeCloudPlatformRoute53ReadRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (sensitive value)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_cloud_platform_route53_read_role_policy_attatchment will be created
  + resource "aws_iam_role_policy_attachment" "assume_cloud_platform_route53_read_role_policy_attatchment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "assume_cloud_platform_route53_read_role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```